# 2.1 - Pandas Deepdive

![pandas_deep](images/pandas_deep.jpg)

### Importar un archivo

In [1]:
import numpy as np     # importar librerias
import pandas as pd

In [58]:
pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv').head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [2]:
df=pd.read_excel('../data/Online Retail.xlsx')  # cargar archivo

df.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [3]:
df['NullID']=[i if i%2 else None for i in range(len(df))]  # columna de nulos

df.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country,NullID
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [4]:
# renombrar columnas

df.columns

Index(['InvoiceNo', 'InvoiceDate', 'StockCode', 'Description', 'Quantity',
       'UnitPrice', 'Revenue', 'CustomerID', 'Country', 'NullID'],
      dtype='object')

In [5]:
n_columnas=[c.lower() for c in df.columns]

n_columnas

['invoiceno',
 'invoicedate',
 'stockcode',
 'description',
 'quantity',
 'unitprice',
 'revenue',
 'customerid',
 'country',
 'nullid']

In [6]:
df.columns=n_columnas

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [7]:
df=df.rename(columns={'invoiceno': 'no'})

df.head()

,no,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [8]:
list(zip(df.columns, n_columnas))

[('no', 'invoiceno'),
 ('invoicedate', 'invoicedate'),
 ('stockcode', 'stockcode'),
 ('description', 'description'),
 ('quantity', 'quantity'),
 ('unitprice', 'unitprice'),
 ('revenue', 'revenue'),
 ('customerid', 'customerid'),
 ('country', 'country'),
 ('nullid', 'nullid')]

In [9]:
df=df.rename(columns={k:v for k,v in zip(df.columns, n_columnas)})  # k=vieja columna, v=nueva columna

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

### Descripción de los datos

In [10]:
df.shape

(396034, 10)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 30.2+ MB

In [12]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 93.7 MB

In [13]:
df.count()  # valores no nulos

invoiceno      396034
invoicedate    396034
stockcode      396034
description    396034
quantity       396034
unitprice      396034
revenue        396034
customerid     396034
country        396034
nullid         198017
dtype: int64

In [14]:
df['country'].value_counts()  # cuenta de valores unicos en la columna

United Kingdom          353983
Germany                   8658
France                    8034
EIRE                      7136
Spain                     2422
Netherlands               2322
Belgium                   1935
Switzerland               1810
Portugal                  1425
Australia                 1181
Norway                    1048
Channel Islands            744
Italy                      741
Finland                    647
Cyprus                     612
Sweden                     428
Austria                    384
Denmark                    367
Poland                     325
Japan                      321
Israel                     248
Singapore                  215
Iceland                    182
USA                        179
Canada                     150
Greece                     142
Malta                      109
United Arab Emirates        67
South Africa                57
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              24
Bahrain                     17
Saudi Arabia                 9
Name: country, dtype: int64

In [15]:
df['country'].unique()  # valores unicos en la columna

array(['United Kingdom', 'Spain', 'Cyprus', 'EIRE', 'Portugal',
       'Netherlands', 'Australia', 'Singapore', 'Switzerland', 'Finland',
       'Channel Islands', 'France', 'Malta', 'Italy', 'Israel', 'Germany',
       'Austria', 'Norway', 'Denmark', 'Sweden', 'Belgium', 'Canada',
       'Poland', 'Japan', 'Iceland', 'Greece', 'Lebanon', 'South Africa',
       'Czech Republic', 'USA', 'Brazil', 'United Arab Emirates',
       'Lithuania', 'Saudi Arabia', 'Bahrain'], dtype=object)

In [16]:
df['country'].nunique()

35

In [17]:
len(df['country'].unique())

35

In [18]:
# descripcion estadistica

df.describe()

,invoiceno,quantity,unitprice,revenue,customerid,nullid
count,396034.000000,396034.000000,396034.000000,396034.000000,396034.000000,198017.000000
mean,560620.294401,12.624838,2.867826,21.492062,15302.695435,198017.000000
std,13110.655964,42.816911,4.265226,93.863439,1709.744925,114325.456929
min,536365.000000,1.000000,0.040000,0.060000,12347.000000,1.000000
25%,549198.500000,2.000000,1.250000,4.680000,13975.000000,99009.000000
50%,561894.000000,6.000000,1.950000,11.800000,15160.000000,198017.000000
75%,572095.000000,12.000000,3.750000,19.800000,16805.000000,297025.000000
max,581587.000000,4800.000000,649.500000,38970.000000,18287.000000,396033.000000

In [19]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
invoiceno,396034.0,560620.294401,13110.655964,536365.00,549198.50,561894.00,572095.00,581587.0
quantity,396034.0,12.624838,42.816911,1.00,2.00,6.00,12.00,4800.0
unitprice,396034.0,2.867826,4.265226,0.04,1.25,1.95,3.75,649.5
revenue,396034.0,21.492062,93.863439,0.06,4.68,11.80,19.80,38970.0
customerid,396034.0,15302.695435,1709.744925,12347.00,13975.00,15160.00,16805.00,18287.0
nullid,198017.0,198017.000000,114325.456929,1.00,99009.00,198017.00,297025.00,396033.0

In [20]:
df.describe().T['50%']   # es la mediana

invoiceno     561894.00
quantity           6.00
unitprice          1.95
revenue           11.80
customerid     15160.00
nullid        198017.00
Name: 50%, dtype: float64

In [21]:
df.median()

<ipython-input-21-6d467abf240d>:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  df.median()

invoiceno     561894.00
quantity           6.00
unitprice          1.95
revenue           11.80
customerid     15160.00
nullid        198017.00
dtype: float64

### Selección dentro del dataframe

In [22]:
df[['quantity', 'unitprice']].head()  # seleccion por nombre de columna

   quantity  unitprice
0         6       2.55
1         6       2.55
2         6       2.55
3        64       2.55
4        32       2.55

In [23]:
df[df.quantity==6].head()  # seleccion segun condicion

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,5.0
8,536502,2010-12-01 12:36:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,16552,United Kingdom,NaN

In [24]:
df[~(df.quantity==6)].head()  # ~ es el NO logico, lo que no es 6

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.60,13408,United Kingdom,NaN
6,536401,2010-12-01 11:21:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,4,2.95,11.80,15862,United Kingdom,NaN
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.40,17850,United Kingdom,7.0
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3,2.95,8.85,14729,United Kingdom,9.0

In [25]:
df[(df.quantity==6) & (df.unitprice==2.55)].head()   # & es el y logico

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,5.0
15,536600,2010-12-02 08:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,15.0

In [26]:
df[(df.quantity==6) | (df.unitprice==2.55)].head()   # | es el o logico

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [27]:
df[~(df.quantity==6) & (df.unitprice==2.55)].head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.4,17850,United Kingdom,7.0
11,536575,2010-12-01 16:01:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,128,2.55,326.4,13777,United Kingdom,11.0
12,536576,2010-12-01 16:11:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,128,2.55,326.4,13777,United Kingdom,NaN

In [28]:
df[(df.quantity!=6) & (df.unitprice==2.55)].head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.4,17850,United Kingdom,7.0
11,536575,2010-12-01 16:01:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,128,2.55,326.4,13777,United Kingdom,11.0
12,536576,2010-12-01 16:11:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,128,2.55,326.4,13777,United Kingdom,NaN

In [29]:
# seleccion por indice

df.iloc[3]

invoiceno                                  536390
invoicedate                   2010-12-01 10:19:00
stockcode                                  85123A
description    CREAM HANGING HEART T-LIGHT HOLDER
quantity                                       64
unitprice                                    2.55
revenue                                     163.2
customerid                                  17511
country                            United Kingdom
nullid                                        3.0
Name: 3, dtype: object

In [30]:
df.iloc[:2]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0

In [31]:
df.iloc[:2, 1:3]

          invoicedate stockcode
0 2010-12-01 08:26:00    85123A
1 2010-12-01 09:02:00    85123A

In [32]:
df.loc[:2]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN

In [33]:
df.loc[:2, 'description']

0    CREAM HANGING HEART T-LIGHT HOLDER
1    CREAM HANGING HEART T-LIGHT HOLDER
2    CREAM HANGING HEART T-LIGHT HOLDER
Name: description, dtype: object

In [34]:
df.loc[:2, ['description', 'country', 'nullid']]

                          description         country  nullid
0  CREAM HANGING HEART T-LIGHT HOLDER  United Kingdom     NaN
1  CREAM HANGING HEART T-LIGHT HOLDER  United Kingdom     1.0
2  CREAM HANGING HEART T-LIGHT HOLDER  United Kingdom     NaN

In [35]:
df.sample(4)

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
39298,560260,2011-07-17 13:32:00,21175,GIN + TONIC DIET METAL SIGN,1,2.55,2.55,14044,United Kingdom,NaN
237637,549732,2011-04-11 16:47:00,71459,HANGING JAM JAR T-LIGHT HOLDER,12,0.85,10.20,15615,United Kingdom,237637.0
169107,576372,2011-11-15 08:32:00,22561,WOODEN SCHOOL COLOURING SET,12,1.65,19.80,15144,United Kingdom,169107.0
284299,577128,2011-11-17 19:48:00,21896,POTTING SHED TWINE,1,2.10,2.10,14508,United Kingdom,284299.0

In [36]:
df.sample(4, random_state=42)  # random state es la semilla de los nos aleatorios

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
6650,548308,2011-03-30 12:00:00,22749,FELTCRAFT PRINCESS CHARLOTTE DOLL,1,3.75,3.75,17220,United Kingdom,NaN
222275,577519,2011-11-20 13:20:00,20986,BLUE CALCULATOR RULER,12,1.25,15.00,15044,United Kingdom,222275.0
59107,546015,2011-03-08 16:48:00,84970S,HANGING HEART ZINC T-LIGHT HOLDER,12,0.85,10.20,14336,United Kingdom,59107.0
86908,575624,2011-11-10 13:18:00,21108,FAIRY CAKE FLANNEL ASSORTED COLOUR,18,0.79,14.22,18217,United Kingdom,NaN

In [37]:
df.sample(frac=0.1).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
320146,561125,2011-07-25 12:58:00,23052,RECYCLED ACAPULCO MAT TURQUOISE,2,8.25,16.50,17364,United Kingdom,NaN
154264,562102,2011-08-02 14:21:00,22907,PACK OF 20 NAPKINS PANTRY DESIGN,24,0.85,20.40,13089,United Kingdom,NaN
382362,571850,2011-10-19 12:54:00,23399,HOME SWEET HOME HANGING HEART,5,0.85,4.25,14698,United Kingdom,NaN
221400,536672,2010-12-02 12:10:00,21288,STRIPEY CHOCOLATE NESTING BOXES,6,2.95,17.70,14491,United Kingdom,NaN
144628,550822,2011-04-21 09:26:00,22087,PAPER BUNTING WHITE LACE,12,2.95,35.40,14001,United Kingdom,NaN

In [38]:
df._get_numeric_data().head()

   invoiceno  quantity  unitprice  revenue  customerid  nullid
0     536365         6       2.55     15.3       17850     NaN
1     536373         6       2.55     15.3       17850     1.0
2     536375         6       2.55     15.3       17850     NaN
3     536390        64       2.55    163.2       17511     3.0
4     536394        32       2.55     81.6       13408     NaN

In [39]:
df.select_dtypes(include=['float64', 'object']).head()

,stockcode,description,unitprice,revenue,country,nullid
0,85123A,CREAM HANGING HEART T-LIGHT HOLDER,2.55,15.3,United Kingdom,NaN
1,85123A,CREAM HANGING HEART T-LIGHT HOLDER,2.55,15.3,United Kingdom,1.0
2,85123A,CREAM HANGING HEART T-LIGHT HOLDER,2.55,15.3,United Kingdom,NaN
3,85123A,CREAM HANGING HEART T-LIGHT HOLDER,2.55,163.2,United Kingdom,3.0
4,85123A,CREAM HANGING HEART T-LIGHT HOLDER,2.55,81.6,United Kingdom,NaN

### Cambio del tipo de datos

In [40]:
df.quantity.astype(dtype='float32')

0          6.0
1          6.0
2          6.0
3         64.0
4         32.0
          ...
396029    12.0
396030    12.0
396031    12.0
396032    12.0
396033     1.0
Name: quantity, Length: 396034, dtype: float32

In [41]:
df.quantity=df.quantity.astype(dtype='float32')

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,NaN

### Manejo de valores nulos

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  float32
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float32(1), float64(3), int64(2), object(3)
memory usage: 28.7+ MB

In [43]:
df.isna().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,False,False,False,False,False,False,False,False,False,True
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,True

In [44]:
df.notna().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,True,True,True,True,True,True,True,True,True,False
1,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,False
3,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,False

In [45]:
nan_cols=df.isna().sum()

nan_cols[nan_cols>0]

nullid    198017
dtype: int64

**¿Qué hacemos?**

In [46]:
# rellenar con 0

df.fillna(0).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,0.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,0.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,0.0

In [47]:
# rellenar con media

df.fillna(df.nullid.mean()).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,198017.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,198017.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,198017.0

### https://www.geeksforgeeks.org/python-pandas-dataframe-ffill/

### https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.interpolate.html

In [48]:
# rellenar con total

df.fillna(df.nullid.sum()).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,3.921073e+10
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.000000e+00
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,3.921073e+10
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.000000e+00
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,3.921073e+10

In [49]:
# rellenar con minimmo

df.fillna(df.nullid.min()).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,1.0

In [50]:
# rellenar con mediana

df.fillna(df.nullid.median()).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,198017.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,198017.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,198017.0

In [51]:
# borrar columna

df.drop('nullid', axis=1).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom

In [52]:
df.drop(columns=['revenue', 'customerid', 'country']).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,NaN

In [53]:
df[df['nullid'].notna()]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.30,17850,United Kingdom,1.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.20,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.30,17850,United Kingdom,5.0
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8.0,2.55,20.40,17850,United Kingdom,7.0
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3.0,2.95,8.85,14729,United Kingdom,9.0
...,...,...,...,...,...,...,...,...,...,...
396025,581173,2011-12-07 15:07:00,90214F,"LETTER ""F"" BLING KEY RING",1.0,0.29,0.29,17870,United Kingdom,396025.0
396027,580691,2011-12-05 15:48:00,90214T,"LETTER ""T"" BLING KEY RING",12.0,0.29,3.48,13790,United Kingdom,396027.0
396029,580691,2011-12-05 15:48:00,90214W,"LETTER ""W"" BLING KEY RING",12.0,0.29,3.48,13790,United Kingdom,396029.0
396031,580865,2011-12-06 11:58:00,90089,PINK CRYSTAL SKULL PHONE CHARM,12.0,0.19,2.28,17914,United Kingdom,396031.0
396033,581425,2011-12-08 15:31:00,90089,PINK CRYSTAL SKULL PHONE CHARM,1.0,0.19,0.19,14796,United Kingdom,396033.0

In [54]:
df.dropna().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.30,17850,United Kingdom,1.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.20,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.30,17850,United Kingdom,5.0
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8.0,2.55,20.40,17850,United Kingdom,7.0
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3.0,2.95,8.85,14729,United Kingdom,9.0

In [55]:
df.drop_duplicates().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32.0,2.55,81.6,13408,United Kingdom,NaN

In [56]:
df.drop_duplicates(subset=['country']).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.55,15.30,17850,United Kingdom,NaN
103,538095,2010-12-09 14:55:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,1.0,2.95,2.95,17097,Spain,103.0
147,538826,2010-12-14 12:58:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64.0,2.55,163.20,12370,Cyprus,147.0
179,539320,2010-12-16 19:16:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,24.0,2.95,70.80,14911,EIRE,179.0
183,539353,2010-12-17 11:30:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6.0,2.95,17.70,12782,Portugal,183.0

### Agrupación

In [64]:
df.groupby('country').agg('count').head()   # el groupby necesita siempre siempre una funcion de agragacion

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,nullid
country,,,,,,,,,
Australia,1181,1181,1181,1181,1181,1181,1181,1181,569
Austria,384,384,384,384,384,384,384,384,190
Bahrain,17,17,17,17,17,17,17,17,6
Belgium,1935,1935,1935,1935,1935,1935,1935,1935,968
Brazil,32,32,32,32,32,32,32,32,14

In [63]:
df.groupby('country').agg('sum').head()

            invoiceno  quantity  unitprice    revenue  customerid       nullid
country
Australia   656866967   83900.0    3262.50  138171.31    14708852  116591145.0
Austria     216042887    4844.0    1145.90    8742.68     4808382   36538436.0
Bahrain       9397437     260.0      78.95     548.40      210027    1300214.0
Belgium    1084768176   22962.0    5887.85   36927.34    24054214  193310168.0
Brazil       17606432     356.0     142.60    1143.60      408608    2712644.0

In [65]:
df.groupby('country').sum().head()

            invoiceno  quantity  unitprice    revenue  customerid       nullid
country
Australia   656866967   83900.0    3262.50  138171.31    14708852  116591145.0
Austria     216042887    4844.0    1145.90    8742.68     4808382   36538436.0
Bahrain       9397437     260.0      78.95     548.40      210027    1300214.0
Belgium    1084768176   22962.0    5887.85   36927.34    24054214  193310168.0
Brazil       17606432     356.0     142.60    1143.60      408608    2712644.0

In [66]:
df.groupby('country').agg({'quantity': 'sum', 'unitprice':'mean'}).head()

           quantity  unitprice
country
Australia   83900.0   2.762489
Austria      4844.0   2.984115
Bahrain       260.0   4.644118
Belgium     22962.0   3.042817
Brazil        356.0   4.456250

In [69]:
df.groupby(['country', 'unitprice']).sum().head()

                     invoiceno  quantity  revenue  customerid     nullid
country   unitprice
Australia 0.19         1132005     336.0    63.84       24803        0.0
          0.25         1636425    1296.0   324.00       37245   511259.0
          0.29         1116836     288.0    83.52       24830   548472.0
          0.34        11116261    4400.0  1496.00      248300  3029609.0
          0.36        18834296    5756.0  2072.16      422081  2729542.0

In [71]:
df.groupby(['country', 'unitprice']).sum().index[:5]

MultiIndex([('Australia', 0.19),
            ('Australia', 0.25),
            ('Australia', 0.29),
            ('Australia', 0.34),
            ('Australia', 0.36)],
           names=['country', 'unitprice'])

In [72]:
def suma(x):
    return sum(x)

In [73]:
df.groupby('country').agg({'quantity': suma}).head()

           quantity
country
Australia   83900.0
Austria      4844.0
Bahrain       260.0
Belgium     22962.0
Brazil        356.0

In [74]:
df.groupby('country').agg({'quantity': 'sum'}).head()

           quantity
country
Australia   83900.0
Austria      4844.0
Bahrain       260.0
Belgium     22962.0
Brazil        356.0

In [75]:
df.groupby('country').agg({'unitprice': ['mean', 'std', 'min', 'max', 'median']}).head()

          unitprice
               mean       std   min    max median
country
Australia  2.762489  2.424046  0.19  14.95   1.79
Austria    2.984115  3.161760  0.12  16.95   1.95
Bahrain    4.644118  3.673634  1.25  12.75   2.95
Belgium    3.042817  3.402533  0.12  39.95   1.95
Brazil     4.456250  2.831727  0.85  10.95   3.32

In [76]:
df.groupby('country').agg(['mean', 'std', 'min', 'max', 'median']).head()

               invoiceno                                         quantity  \
                    mean           std     min     max  median       mean
country
Australia  556195.569009  10347.568409  536389  578459  556917  71.041489
Austria    562611.684896  10375.962626  539330  581232  562602  12.614583
Bahrain    552790.411765    634.431346  552449  553900  552449  15.294118
Belgium    560603.708527  11977.330901  537026  581493  561507  11.866667
Brazil     550201.000000      0.000000  550201  550201  550201  11.125000

                                          ...    customerid              \
                 std  min     max median  ...          mean         std
country                                   ...
Australia  98.776914  1.0  1152.0   32.0  ...  12454.574090  392.096266
Austria    21.898112  1.0   288.0   10.0  ...  12521.828125  217.057432
Bahrain    24.959379  2.0    96.0    6.0  ...  12354.529412    0.874475
Belgium    13.787267  1.0   272.0   10.0  ...  12431.118346  111.880194
Brazil      8.476723  2.0    24.0   10.0  ...  12769.000000    0.000000

                                       nullid                           \
             min    max median           mean            std       min
country
Australia  12386  16321  12415  204905.351494  119222.565962     307.0
Austria    12358  12865  12374  192307.557895  114040.947192    2527.0
Bahrain    12353  12355  12355  216702.333333   66964.683464  142833.0
Belgium    12361  12876  12407  199700.586777  116219.245415    3461.0
Brazil     12769  12769  12769  193760.285714  115305.958108   14907.0


                max    median
country
Australia  395047.0  213031.0
Austria    389317.0  198362.0
Bahrain    321717.0  216515.0
Belgium    395999.0  206364.0
Brazil     320031.0  187979.0

[5 rows x 30 columns]

In [77]:
tmp_df=df.groupby('country').agg(['mean', 'std', 'min', 'max', 'median'])

In [82]:
tmp_df['invoiceno']['mean'][:4]

country
Australia    556195.569009
Austria      562611.684896
Bahrain      552790.411765
Belgium      560603.708527
Name: mean, dtype: float64

### Pivot table

In [84]:
pd.set_option('display.max_columns', None)   # para que printee todas las columnas

In [87]:
student=pd.read_csv('../data/student-por.csv', sep=';')

student.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,traveltime,studytime,failures,schoolsup,famsup,paid,activities,nursery,higher,internet,romantic,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother,2,2,0,yes,no,no,no,yes,yes,no,no,4,3,4,1,1,3,4,0,11,11
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father,1,2,0,no,yes,no,no,no,yes,yes,no,5,3,3,1,1,3,2,9,11,11
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother,1,2,0,yes,no,no,no,yes,yes,yes,no,4,3,2,2,3,3,6,12,13,12
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother,1,3,0,no,yes,no,yes,yes,yes,yes,yes,3,2,2,1,1,5,0,14,14,14
4,GP,F,16,U,GT3,T,3,3,other,other,home,father,1,2,0,no,yes,no,no,yes,yes,no,no,4,3,2,1,2,5,0,11,13,13

In [88]:
student.pivot_table(index=['school'], columns=['sex'])

            Dalc                Fedu                   G1             \
sex            F         M         F         M          F          M
school
GP      1.291139  1.698925  2.396624  2.575269  12.286920  11.602151
MS      1.273973  2.087500  1.958904  2.050000  10.582192   9.787500

               G2                    G3                 Medu            \
sex             F          M          F          M         F         M
school
GP      12.502110  11.688172  13.004219  12.032258  2.607595  2.876344
MS      10.719178  10.087500  11.034247   9.950000  2.068493  2.212500

            Walc            absences                  age             \
sex            F         M         F         M          F          M
school
GP      1.978903  2.634409  4.405063  3.973118  16.738397  16.575269
MS      1.869863  3.100000  2.232877  3.325000  16.869863  16.925000

        failures              famrel            freetime               goout  \
sex            F         M         F         M         F         M         F
school
GP      0.126582  0.231183  3.886076  4.037634  2.953586  3.408602  3.109705
MS      0.280822  0.375000  3.828767  4.000000  3.212329  3.262500  3.157534

                    health           studytime           traveltime
sex            M         F         M         F         M          F         M
school
GP      3.193548  3.464135  3.768817  2.189873  1.790323   1.405063  1.462366
MS      3.437500  3.212329  3.800000  1.883562  1.575000   1.767123  1.937500

In [101]:
%%time

student.pivot_table(index=['school'], columns=['sex'], values=['G3'])

CPU times: user 14 ms, sys: 2.44 ms, total: 16.5 ms
Wall time: 14.6 ms

               G3
sex             F          M
school
GP      13.004219  12.032258
MS      11.034247   9.950000

In [90]:
student.pivot_table(index=['school'], columns=['sex'], values=['G3'], aggfunc='mean')

               G3
sex             F          M
school
GP      13.004219  12.032258
MS      11.034247   9.950000

In [91]:
student.pivot_table(index=['school'], columns=['sex'], values=['G3'], aggfunc='count')

         G3
sex       F    M
school
GP      237  186
MS      146   80

In [92]:
student.pivot_table(index=['school'], columns=['sex', 'studytime'], values=['G3'], aggfunc='count')

           G3
sex         F                M
studytime   1    2   3   4   1   2   3   4
school
GP         42  125  53  17  77  81  18  10
MS         47   73  22   4  46  26   4   4

In [93]:
help(student.pivot_table)

Help on method pivot_table in module pandas.core.frame:

pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Create a spreadsheet-style pivot table as a DataFrame.

    The levels in the pivot table will be stored in MultiIndex objects
    (hierarchical indexes) on the index and columns of the result DataFrame.

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function, list of functions, dict, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
        If dict is passed, the key is column to aggregate and value
        is function or list of functions.
    fill_value : scalar, default None
        Value to replace missing values with (in the resulting pivot table,
        after aggregation).
    margins : bool, default False
        Add all row / columns (e.g. for subtotal / grand totals).
    dropna : bool, default True
        Do not include columns whose entries are all NaN.
    margins_name : str, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionchanged:: 0.25.0

    Returns
    -------
    DataFrame
        An Excel style pivot table.

    See Also
    --------
    DataFrame.pivot : Pivot without aggregation that can handle
        non-numeric data.
    DataFrame.melt: Unpivot a DataFrame from wide to long format,
        optionally leaving identifiers set.
    wide_to_long : Wide panel to long format. Less flexible but more
        user-friendly than melt.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
    ...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
    >>> df
         A    B      C  D  E
    0  foo  one  small  1  2
    1  foo  one  large  2  4
    2  foo  one  large  2  5
    3  foo  two  small  3  5
    4  foo  two  small  3  6
    5  bar  one  large  4  6
    6  bar  one  small  5  8
    7  bar  two  small  6  9
    8  bar  two  large  7  9

    This first example aggregates values by taking the sum.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    We can also fill missing values using the `fill_value` parameter.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum, fill_value=0)
    >>> table
    C        large  small
    A   B
    bar one      4      5
        two      7      6
    foo one      4      1
        two      0      6

    The next example aggregates by taking the mean across multiple columns.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': np.mean})
    >>> table
                    D         E
    A   C
    bar large  5.500000  7.500000
        small  5.500000  8.500000
    foo large  2.000000  4.500000
        small  2.333333  4.333333

    We can also calculate multiple types of aggregations for any given
    value column.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': [min, max, np.mean]})
    >>> table
                    D    E
                mean  max      mean  min
    A   C
    bar large  5.500000  9.0  7.500000  6.0
        small  5.500000  9.0  8.500000  8.0
    foo large  2.000000  5.0  4.500000  4.0
        small  2.333333  6.0  4.333333  2.0

### Cross table

In [94]:
pd.crosstab(index=student.sex, columns='count')

col_0  count
sex
F        383
M        266

In [102]:
%%time

pd.crosstab(index=student.sex, columns=student.activities)

CPU times: user 15.6 ms, sys: 2.31 ms, total: 17.9 ms
Wall time: 16.1 ms

activities   no  yes
sex
F           217  166
M           117  149

In [98]:
pd.crosstab(index=student.sex, columns=student.activities, values=student.absences, aggfunc='count')

activities   no  yes
sex
F           217  166
M           117  149

In [99]:
pd.crosstab(index=student.sex, columns=student.activities, values=student.absences, aggfunc='sum')

activities   no  yes
sex
F           817  553
M           428  577

In [100]:
help(pd.crosstab)

Help on function crosstab in module pandas.core.reshape.pivot:

crosstab(index, columns, values=None, rownames=None, colnames=None, aggfunc=None, margins=False, margins_name: str = 'All', dropna: bool = True, normalize=False) -> 'DataFrame'
    Compute a simple cross tabulation of two (or more) factors. By default
    computes a frequency table of the factors unless an array of values and an
    aggregation function are passed.

    Parameters
    ----------
    index : array-like, Series, or list of arrays/Series
        Values to group by in the rows.
    columns : array-like, Series, or list of arrays/Series
        Values to group by in the columns.
    values : array-like, optional
        Array of values to aggregate according to the factors.
        Requires `aggfunc` be specified.
    rownames : sequence, default None
        If passed, must match number of row arrays passed.
    colnames : sequence, default None
        If passed, must match number of column arrays passed.
    aggfunc : function, optional
        If specified, requires `values` be specified as well.
    margins : bool, default False
        Add row/column margins (subtotals).
    margins_name : str, default 'All'
        Name of the row/column that will contain the totals
        when margins is True.
    dropna : bool, default True
        Do not include columns whose entries are all NaN.
    normalize : bool, {'all', 'index', 'columns'}, or {0,1}, default False
        Normalize by dividing all values by the sum of values.

        - If passed 'all' or `True`, will normalize over all values.
        - If passed 'index' will normalize over each row.
        - If passed 'columns' will normalize over each column.
        - If margins is `True`, will also normalize margin values.

    Returns
    -------
    DataFrame
        Cross tabulation of the data.

    See Also
    --------
    DataFrame.pivot : Reshape data based on column values.
    pivot_table : Create a pivot table as a DataFrame.

    Notes
    -----
    Any Series passed will have their name attributes used unless row or column
    names for the cross-tabulation are specified.

    Any input passed containing Categorical data will have **all** of its
    categories included in the cross-tabulation, even if the actual data does
    not contain any instances of a particular category.

    In the event that there aren't overlapping indexes an empty DataFrame will
    be returned.

    Examples
    --------
    >>> a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
    ...               "bar", "bar", "foo", "foo", "foo"], dtype=object)
    >>> b = np.array(["one", "one", "one", "two", "one", "one",
    ...               "one", "two", "two", "two", "one"], dtype=object)
    >>> c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
    ...               "shiny", "dull", "shiny", "shiny", "shiny"],
    ...              dtype=object)
    >>> pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])
    b   one        two
    c   dull shiny dull shiny
    a
    bar    1     2    1     0
    foo    2     2    1     2

    Here 'c' and 'f' are not represented in the data and will not be
    shown in the output because dropna is True by default. Set
    dropna=False to preserve categories with no data.

    >>> foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])
    >>> bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])
    >>> pd.crosstab(foo, bar)
    col_0  d  e
    row_0
    a      1  0
    b      0  1
    >>> pd.crosstab(foo, bar, dropna=False)
    col_0  d  e  f
    row_0
    a      1  0  0
    b      0  1  0
    c      0  0  0

### Aplicación de funciones

### Json Normalize, Explode

### Unión de dataframes

### Eval y query

### lookup

### get

### index y reindex

### Multi index

### Exportar datos

### Métodos habituales de pandas

```python
df.head()                     # printea la cabeza, por defecto 5 filas
df.tail()                     # pritea la cola, por defecto 5 filas
df.describe()                 # descripcion estadistica
df.info()                     # informacion del df
df.info(memory_usage='deep')
df.columns                    # muestra columna
df.index                      # muestra indice
df.dtypes                     # muestra tipos de datos de las columnas
df.plot()                     # hace un grafico
df.hist()                     # hace un histograma
df.col.value_counts()         # cuenta los valores unicos de una columna
df.col.unique()               # muestra valores unicos de una columna
df.copy()                     # copia el df
df.drop()                     # elimina columnas o filas (axis=0,1)
df.dropna()                   # elimina nulos
df.fillna()                   # rellena nulos
df.shape                      # dimensiones del df
df._get_numeric_data()        # selecciona columnas numericas
df.rename()                   # renombre columnas
df.str.replace()              # reemplaza columnas de strings
df.astype(dtype='float32')    # cambia el tipo de dato
df.iloc[]                     # localiza por indice
df.loc[]                      # localiza por elemento
df.transpose()                # transpone el df
df.T
df.sample(n, frac)            # muestra del df
df.col.sum()                  # suma de una columna
df.col.max()                  # maximo de una columna
df.col.min()                  # minimo de una columna
df[col]                       # selecciona columna
df.col
df.isnull()                   # valores nulos
df.isna()
df.notna()                    # valores no nulos
df.drop_duplicates()          # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe
```